Proyecto-02/Code/benchmarks/multi_topology.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: tests/load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 5 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  01.0s/30s

running (0m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  02.0s/30s

running (0m03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  03.0s/30s

running (0m04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  04.0s/30s

running (0m05.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  05.0s/30s

running (0m06.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  06.0s/30s

running (0m07.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  07.0s/30s

running (0m08.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  08.0s/30s

running (0m09.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  09.0s/30s

running (0m10.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  10.0s/30s

running (0m11.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  11.0s/30s

running (0m12.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  12.0s/30s

running (0m13.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  13.0s/30s

running (0m14.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  14.0s/30s

running (0m15.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  15.0s/30s

running (0m16.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  16.0s/30s

running (0m17.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  17.0s/30s

running (0m18.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  18.0s/30s

running (0m19.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  19.0s/30s

running (0m20.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  20.0s/30s

running (0m21.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  21.0s/30s

running (0m22.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  22.0s/30s

running (0m23.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  23.0s/30s

running (0m24.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  24.0s/30s

running (0m25.0s), 5/5 VUs, 28 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  25.0s/30s

running (0m26.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  26.0s/30s

running (0m27.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  27.0s/30s

running (0m28.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  28.0s/30s

running (0m29.0s), 5/5 VUs, 31 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  29.0s/30s

running (0m30.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  30.0s/30s

running (0m31.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  30s

running (0m32.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  30s

running (0m33.0s), 4/5 VUs, 36 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=113.64ms

    ingest_success
    ✓ 'rate>0.95' rate=100.00%

    topology_submit_success
    ✓ 'rate>0.9' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 161     4.847023/s
    checks_succeeded...: 100.00% 161 out of 161
    checks_failed......: 0.00%   0 out of 161

    ✓ master is alive
    ✓ topology submit status 200
    ✓ topology has id
    ✓ ingest status 202
    ✓ status check success

    CUSTOM
    ingest_latency_ms..............: avg=59.825  min=13       med=31      max=312      p(90)=228.5   p(95)=272.2   
    ingest_success.................: 100.00% 40 out of 40
    topology_submit_success........: 100.00% 40 out of 40

    HTTP
    http_req_duration..............: avg=32.93ms min=156.66µs med=18.62ms max=310.89ms p(90)=56.23ms p(95)=113.64ms
      { expected_response:true }...: avg=32.93ms min=156.66µs med=18.62ms max=310.89ms p(90)=56.23ms p(95)=113.64ms
    http_req_failed................: 0.00%   0 out of 162
    http_reqs......................: 162     4.877128/s

    EXECUTION
    iteration_duration.............: avg=4.13s   min=4.04s    med=4.1s    max=4.36s    p(90)=4.28s   p(95)=4.31s   
    iterations.....................: 40      1.204229/s
    vus............................: 4       min=4        max=5
    vus_max........................: 5       min=5        max=5

    NETWORK
    data_received..................: 1.2 MB  35 kB/s
    data_sent......................: 94 kB   2.8 kB/s



running (0m33.2s), 0/5 VUs, 40 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  30s